{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4", "config": {"name": "sequential_7", "layers": [{"class_name": "Dense", "config": {"trainable": true, "units": 500, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "activity_regularizer": null, "name": "dense_19", "activation": "linear", "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "batch_input_shape": [null, 784], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_19", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "dense_20", "activation": "linear", "bias_constraint": null, "units": 100, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_20", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "dense_21", "activation": "linear", "bias_constraint": null, "units": 10, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_21", "trainable": true, "activation": "softmax"}}]}}