{"backend": "tensorflow", "keras_version": "2.2.4", "config": {"layers": [{"config": {"bias_constraint": null, "activation": "linear", "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 784], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "units": 500, "use_bias": true, "name": "dense_10", "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_10", "trainable": true}, "class_name": "Activation"}, {"config": {"bias_constraint": null, "activation": "linear", "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "units": 100, "use_bias": true, "name": "dense_11", "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_11", "trainable": true}, "class_name": "Activation"}, {"config": {"bias_constraint": null, "activation": "linear", "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "units": 10, "use_bias": true, "name": "dense_12", "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_12", "trainable": true}, "class_name": "Activation"}], "name": "sequential_4"}, "class_name": "Sequential"}