{"config": {"layers": [{"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "use_bias": true, "units": 4, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "batch_input_shape": [null, 784], "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_5"}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_4"}}, {"class_name": "Dense", "config": {"activation": "linear", "use_bias": true, "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "name": "dense_6"}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_5"}}, {"class_name": "Dense", "config": {"activation": "linear", "use_bias": true, "units": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "name": "dense_7"}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_6"}}], "name": "sequential_2"}, "keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Sequential"}